content/posts/group.md
+++
title = "Group"
author = ["Sangwon Hyun"]
lastmod = 2026-03-23T12:13:14-07:00
slug = "research"
draft = false
+++

I am recruiting for highly motivated postdoctoral scholars, graduate students,
and undergraduate students to join my group!


## Post-docs {#post-docs}

Riddhiman Bhattacharya

Trisha Dawn (Incoming)


## Students {#students}


### Current {#current}

[Ethan Pawl](https://ethan-pawl.github.io/) (PhD, Jointly with Paul Parker)

Ziyue Zheng (PhD)

Dane Pearson (Undergrad)


### Alumni {#alumni}

Rafael Catoia (MS, next position: Biostatistician, QSU Stanford Medicine)
